package me.ssu.objectoriented._1.manual;

public class _3_BagManual {
/* 3. 가방(Bag) : 소지품 보관하는 가방(초대장, 티켓, 현금을 변수로 포함)
	-> 이유는 초대장, 현금, 티켓 세가지 뿐이기에 보관할 용도로 가방이 있다 가정
	3-1) 변수
		3-1)-1. 초대장(Invitation)
		3-1)-2. 티켓(Ticket)
		3-1)-3. 현금(Amount)
	3-2) 메소드
		3-2)-1. 초대장의 보유 여부(hasInvitation)
			변수 타임 : boolean
		3-2)-2. 현금 증가, plusAmount(현금), +=
		3-2)-3. 현금 감소, minusAmount(현금), -=
		3-2)-4. 초대장을 티켓으로 교환(setTicket)
	3-3) 생성자 == 객체
		3-1) 이벤트 당첨된 관람객, Bag(초대장, 현금)
			-> 이벤트에 당첨된 관람객의 가방에는 초대장과 현금이 들어 있다.
		3-2) 이벤트 당첨되지 않은 관람객, Bag(현금만)
			-> 현금만 있으면 이벤트에 당첨되지 않았기에 초대장이 없음.
*/
}